# 1. Creating the Employees Table

In [ ]:
CREATE TABLE employees (
    emp_id INTEGER NOT NULL PRIMARY KEY,
    emp_name TEXT NOT NULL,
    age INTEGER CHECK (age >= 18),
    email TEXT UNIQUE,
    salary DECIMAL DEFAULT 30000
);

# 2. Purpose of Constraints and Data Integrity

Constraints enforce rules on data columns to maintain accuracy and reliability in a database. They prevent invalid data entry and help preserve relationships between tables.

Common Constraint Types:
NOT NULL - Ensures a column cannot have NULL values

UNIQUE - Guarantees all values in a column are different

PRIMARY KEY - Uniquely identifies each record (NOT NULL + UNIQUE)

FOREIGN KEY - Maintains referential integrity between tables

CHECK - Validates that values meet specific conditions

DEFAULT - Sets a default value when none is specified

Example: A CHECK constraint on age (age >= 18) prevents hiring underage employees.

# 3.NOT NULL Constraint and Primary Keys

NOT NULL ensures a column must always contain a value, preventing missing data. This is essential for critical fields like employee IDs or names.

Primary keys cannot contain NULL values because:

They must uniquely identify each record

NULL represents unknown/undefined data which violates uniqueness

Database engines enforce this automatically (PRIMARY KEY implies NOT NULL)

# 4. Adding/Removing Constraints

In [ ]:
ALTER TABLE products
ADD CONSTRAINT pk_product PRIMARY KEY (product_id);

ALTER TABLE products
ALTER COLUMN price SET DEFAULT 50.00;

In [ ]:
# removing constraints
ALTER TABLE products
DROP CONSTRAINT pk_product;

ALTER TABLE products
ALTER COLUMN price DROP DEFAULT;

# 5. Constraint Violation Consequences

Attempting to violate constraints results in errors that abort the operation:

Example Violations:

Inserting NULL into a NOT NULL column

Duplicating a PRIMARY KEY value

Violating a CHECK constraint

Example Error:

ERROR: duplicate key value violates unique constraint "employees_email_key"

DETAIL: Key (email)=(john@example.com) already exists.

# 6. Adding Constraints to Products Table

In [ ]:
-- Add primary key constraint
ALTER TABLE products
ADD CONSTRAINT pk_product PRIMARY KEY (product_id);

-- Add default value for price
ALTER TABLE products
ALTER COLUMN price SET DEFAULT 50.00;

# 7. You have two tables

In [ ]:
SELECT 
    s.student_name,
    c.class_name
FROM 
    student_class s
INNER JOIN 
    classes c ON s.class_id = c.class_id;

# 8. You have three tables

In [ ]:
SELECT 
    o.order_id,
    c.customer_name,
    p.product_name
FROM 
    products p
LEFT JOIN 
    order_details od ON p.product_id = od.product_id
LEFT JOIN 
    orders o ON od.order_id = o.order_id
LEFT JOIN 
    customers c ON o.customer_id = c.customer_id;

# 9 Given the following tables:

SELECT 
    p.product_id,
    p.product_name,
    SUM(s.amount) AS total_sales_amount
FROM 
    products p
INNER JOIN 
    sales s ON p.product_id = s.product_id
GROUP BY 
    p.product_id, p.product_name
ORDER BY 
    total_sales_amount DESC;

# 10. Write a query to display the order_id, customer_name, and the quantity of products ordered by each customer using an INNER JOIN between all three tables.

In [ ]:
SELECT 
    o.order_id,
    c.customer_name,
    SUM(od.quantity) AS total_products_ordered
FROM 
    orders o
INNER JOIN 
    customers c ON o.customer_id = c.customer_id
INNER JOIN 
    order_details od ON o.order_id = od.order_id
GROUP BY 
    o.order_id, c.customer_name
ORDER BY 
    o.order_id;

# SQL Commands

# 1. Primary Keys and Foreign Keys

Primary Keys: These are unique identifiers for each record in a table. For example, in common movie databases, you might have:

customer_id in the Customers table

actor_id in the Actors table

film_id in the Films table

Foreign Keys: These reference primary keys in another table and are used to establish relationships between tables. For example:

customer_id in the Rentals table (refers to the Customers table)
film_id in the Rentals table (refers to the Films table)

# 2. List all details of actors

In [ ]:
SELECT * FROM actors;

# 3. List all customer information from DB

In [ ]:
SELECT * FROM customers;

# 4. List different countries

In [ ]:
SELECT DISTINCT country FROM customers;  -- Assuming customers table has a country field

# 5. Display all active customers

In [ ]:
SELECT * FROM customers WHERE status = 'active';  -- Assuming there is a status field

# 6. List all rental IDs for customer with ID 1

In [ ]:
SELECT rental_id FROM rentals WHERE customer_id = 1;

# 7. Display all the films whose rental duration is greater than 5

In [ ]:
SELECT * FROM films WHERE rental_duration > 5;

# 8. List the total number of films whose replacement cost is greater than $15 and less than $20

In [ ]:
SELECT COUNT(*) FROM films WHERE replacement_cost > 15 AND replacement_cost < 20;

# 9. Display the count of unique first names of actors

In [ ]:
SELECT COUNT(DISTINCT first_name) FROM actors;

# 10. Display the first 10 records from the customer table

In [ ]:
SELECT * FROM customers LIMIT 10;

# 11. Display the first 3 records from the customer table whose first name starts with ‘b’

In [ ]:
SELECT * FROM customers WHERE first_name LIKE 'b%' LIMIT 3;

# 12. Display the names of the first 5 movies which are rated as ‘G’

In [ ]:
SELECT title FROM films WHERE rating = 'G' LIMIT 5;

# 13. Find all customers whose first name starts with "a"

In [ ]:
SELECT * FROM customers WHERE first_name LIKE 'a%';

# 14. Find all customers whose first name ends with "a"

In [ ]:
SELECT * FROM customers WHERE first_name LIKE '%a';

# 15. Display the list of first 4 cities which start and end with ‘a’

In [ ]:
SELECT DISTINCT city FROM customers WHERE city LIKE 'a%' AND city LIKE '%a' LIMIT 4;

# 16. Find all customers whose first name has "NI" in any position

In [ ]:
SELECT * FROM customers WHERE first_name LIKE '%NI%';

# 17. Find all customers whose first name has "r" in the second position

In [ ]:
SELECT * FROM customers WHERE first_name LIKE '_r%';

# 18. Find all customers whose first name starts with "a" and are at least 5 characters in length

In [ ]:
SELECT * FROM customers WHERE first_name LIKE 'a%' AND LENGTH(first_name) >= 5;

# 19. Find all customers whose first name starts with "a" and ends with "o"

In [ ]:
SELECT * FROM customers WHERE first_name LIKE 'a%o';

# 20. Get the films with pg and pg-13 rating using IN operator

In [ ]:
SELECT * FROM films WHERE rating IN ('PG', 'PG-13');

# 21. Get the films with length between 50 to 100 using BETWEEN operator

In [ ]:
SELECT * FROM films WHERE length BETWEEN 50 AND 100;

# 22. Get the top 50 actors using LIMIT operator

In [ ]:
SELECT * FROM actors LIMIT 50;

# 23. Get the distinct film ids from inventory table